In [40]:
import pandas  as pd
import numpy as np

In [4]:
print(pd)

<module 'pandas' from 'C:\\Users\\sjuga\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\pandas\\__init__.py'>

In [92]:
#dict1 convert to Pd

dict1={
    "name":["jugal" , "sharma" , "karan" , "anku"],
    "marks":[92 , 40 , 20 , 68],
    "city":["jammu" , "rampur" , "pinkcity" , "newYokr"]
} 

#print(dict1["name"])
df=pd.DataFrame(dict1)
print(df)
#use a list of indexes:
#print(df.loc[[0, 1]])
#convet to csv file
#df.to_csv("friend.csv")
#ff.dtypes
#df.columns
#df.rows
#df.to_csv("friend.csv" , index=False)
df.types

     name  marks      city
0   jugal     92     jammu
1  sharma     40    rampur
2   karan     20  pinkcity
3    anku     68   newYokr

AttributeError: 'DataFrame' object has no attribute 'types'

In [65]:
#check csv file

new.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       20 non-null     float64
 1   1       20 non-null     float64
 2   2       20 non-null     float64
 3   3       20 non-null     float64
 4   4       20 non-null     float64
 5   5       20 non-null     float64
 6   6       20 non-null     float64
 7   7       20 non-null     float64
 8   8       20 non-null     float64
 9   9       20 non-null     float64
dtypes: float64(10)
memory usage: 1.7 KB

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479

     name  marks      city
0   jugal     92     jammu
1  sharma     40    rampur
2   karan     20  pinkcity
3    anku     68   newYokr

In [26]:
df.describe()

           marks
count   4.000000
mean   55.000000
std    31.559468
min    20.000000
25%    35.000000
50%    54.000000
75%    74.000000
max    92.000000

In [36]:
#read csv file

js=pd.read_csv("Shett.csv")
js.head(5)
#df.tail(4)
#js["Price"]
#df.describe()
#skiprow

#ff=pd.read_csv("Shett.csv"  , skiprows=[1 ,2,3])

#ff

       Price       Open       High        Low   data
0  56,506.10  43,824.40  57,814.00  43,292.90  10.21
1  43,823.30  47,129.20  52,885.00  39,646.80   9.21
2  47,130.40  41,510.00  50,498.00  37,365.40   8.21
3  41,553.70  35,030.70  42,285.00  29,310.20   7.21
4  35,026.90  37,294.30  41,318.00  28,901.80   6.21

In [53]:

#create a reandom 
ser=pd.Series(np.random.rand(20))

ser
type(ser)

RangeIndex(start=0, stop=10, step=1)

In [93]:
new=pd.DataFrame(np.random.rand(20 , 10), index=np.arange(20))
type(new)
new.index#check index 
#new.columns
new.to_numpy()#convert to numpy
new.head(5)
##new.sort_index(axis=0 , ascending=False)

,0,1,2,3,4,5,6,7,8,9
0,0.404126,0.392504,0.585745,0.200852,0.948225,0.757123,0.135911,0.779781,0.022050,0.830632
1,0.187971,0.919914,0.118923,0.920087,0.596395,0.175697,0.528580,0.636236,0.779460,0.852861
2,0.632834,0.049283,0.515165,0.924164,0.622540,0.417035,0.976830,0.793052,0.961840,0.342097
3,0.782510,0.413273,0.088487,0.215814,0.173224,0.175201,0.622689,0.042761,0.564042,0.538949
4,0.867579,0.115836,0.687313,0.784031,0.760703,0.847082,0.592531,0.525914,0.156256,0.571996

In [141]:
#remove null and NaN values

nan=pd.read_csv("nullnan.csv")

#nan.isnull()#check null value Show True
nan.isnull().sum()#second check value NAN 

nan.dropna()

#print(nan.to_string())
nan.fillna(2, inplace = True)

In [144]:
#nan.fillna(10)

In [107]:
nan.dropna(inplace=True, axis=0)
nan

#nan.drop_duplicates(inplace=True)

     name class rollNo
0   jugal  10th     20
1  kanika  12th     22
3    anku  Null   Null

In [143]:
# Create a DataFrame with some missing values
data = {'A': [1, 2, 3, 4, None], 'B': [5, None, 7, 8, 9]}
df = pd.DataFrame(data)

# Fill missing values with the median of column A
median = df['A'].median()
df['A'].fillna(median, inplace=True)
median = df['B'].median()
df['B'].fillna(median, inplace=True)
# Print the DataFrame to verify the changes
print(df)

     A    B
0  1.0  5.0
1  2.0  7.5
2  3.0  7.0
3  4.0  8.0
4  2.5  9.0